{
    "recipes": [
  {
      "name": "Chicken Tacos",
      "description": "A delicious and healthy alternative to your favorite Mexican dish!",
      "category": "dinner",
      "servings": 4,
      "cooking_time": "90 Minutes",
      "is_sample": true,
      "image": "/path/to/fake/image",
      "tags": ["Dinner", "Meal Prep"],
      "ingredients": [
          {"name": "Chicken Breast", "amount": "450 Grams"},
          {"name": "Tortilla Wraps", "amount": "6"},
          {"name": "Peppers", "amount": "2"},
          {"name": "Red Onion", "amount": "1"},
          {"name": "Garlic", "amount": "3 cloves"},
          {"name": "Fresh Chilli", "amount": "1"},
          {"name": "Cherry Tomatoes", "amount": "200 Grams"},
          {"name": "Avocado", "amount": "1"},
          {"name": "Honey", "amount": "1 tablespoon"},
          {"name": "Tomato Passata", "amount": "100 ml"},
          {"name": "Hot Sauce", "amount": "20 ml"},
          {"name": "Cumin", "amount": "1 tablespoon"},
          {"name": "Paprika", "amount": "1 tablespoon"},
          {"name": "Cheese", "amount": "50 grams"}
      ],
      "prep_instructions": [
          "Chop up the chilli, garlic, tomatoes, half an onion and a quarter of each of the peppers for the Salsa into very small pieces",
          "Roughly chop the remaining Peppers and onions",
          "Chicken Marinade: Mix together the honey, hot sauce, cumin, paprika, salt, pepper and a quarter of the garlic.",
          "Butterfly the chicken and mix it in with the Marinade",
          "Combine the avocado, salt, pepper, half the chilli and another quarter of the garlic to make the Guacamole"
      ],
      "cooking_instructions": [
          "Pan fry the chicken, flipping over when you see a nice char on the side",
          "Mix the roughly chopped Peppers and Onion with the remaing garlic and chilli. Mix with oil, pepper and salt and put into the oven at 180 degress for 15-20 minutes",
          "Once the chicken is cooked, pull it apart using two forks into shredded pieces",
          "Combine the cooked chicken, roasted veg in a pan and mix in the passata on a low heat. Mix it until everything is combined. Take off the heat once done",
          "Grab a wrap and and press it against the chicken and veg mix. Then place it on a pan on medium heat. Quickly add cheese and your veg/chicken mix to one side of the wrap and fold over.",
          "Flip the wrap over until lightly toasted and then once done, take it off the heat. Open up the wrap and add guacamole and the fresh salsa. It's now ready to eat!"
      ]
  },
  {
      "name": "Meatballs & Tomato Sauce",
      "description": "A versatile recipe for meatballs that you can eat as many ways as you like!",
      "category": "dinner",
      "servings": 4,
      "cooking_time": "90 Minutes",
      "is_sample": true,
      "image": "/path/to/fake/image",
      "tags": ["Dinner", "Meal Prep"],
      "ingredients": [
          {"name": "Beef Mince", "amount": "450 Grams"},
          {"name": "Pork Sausage", "amount": "100 Grams"},
          {"name": "Peppers", "amount": "1"},
          {"name": "Red or White Onion", "amount": "1"},
          {"name": "Garlic", "amount": "4 cloves"},
          {"name": "Fresh Chilli", "amount": "1"},
          {"name": "Chopped Tomatoes", "amount": "400 Grams"},
          {"name": "Chilli Flakes", "amount": "1 teaspoon"},
          {"name": "Honey", "amount": "1 tablespoon"},
          {"name": "Tomato Passata", "amount": "100 ml"},
          {"name": "Dark Chocolate", "amount": "20 grams"},
          {"name": "Butter", "amount": "30 grams"},
          {"name": "Chipotle sauce", "amount": "1 teaspoon"},
          {"name": "Egg", "amount": "1"}
      ],
      "prep_instructions": [
          "Chop up the chilli and garlic into small pieces. Cut the Onion and peppers into strips or pieces around an inch or so long",
          "Mix together the beef mince, an egg, Some chilli flakes, a quarter of the garlic, some salt and some pepper. remove the sausage from its casing and add to the mixture. Combine and shape into small round balls. The size is up to you."
      ],
      "cooking_instructions": [
          "On a medium to high heat, pour some oil into a pan and start placing the meatballs on it when it's heated.You don't need to overcrowd the pan so this can be done in multiple stages",
          "At the same time, on a low heat add some oil and the fresh chilli and remaining garlic. When this start to sizzle add the chopped tomatoes and raise to a simmer.",
          "When the meatballs have browned on all sides, add them to tomato sauce. Once the first batch of meatballs is added you can add the tomato passata, dark chocolate, butter and chipotle sauce as well.",
          "Once all the meatballs are cooked, using the same pan add a little oil and fry off the peppers and the onions",
          "Once the peppers and onions are cooked, add them to the tomato sauce. Let the sauce simmer for 20 mins or so before turning off the heat and letting it cool on the hop. Add salt and pepper to taste during this process"
      ]
  },
  {
      "name": "Beef & Bean Chilli",
      "description": "A quick and easy chilli recipe that is a sharing favorite with friends or even better for meal prep!",
      "category": "dinner",
      "servings": 6,
      "cooking_time": "120 Minutes",
      "is_sample": true,
      "image": "/path/to/fake/image",
      "tags": ["Dinner", "Meal Prep", "For Sharing"],
      "ingredients": [
          {"name": "Beef Mince", "amount": "450 Grams"},
          {"name": "Kidney Beans", "amount": "1 tin"},
          {"name": "Peppers", "amount": "2"},
          {"name": "Red or White Onion", "amount": "1"},
          {"name": "Garlic", "amount": "4 cloves"},
          {"name": "Fresh Chilli", "amount": "1"},
          {"name": "Chopped Tomatoes", "amount": "400 Grams"},
          {"name": "Chilli Flakes", "amount": "1 teaspoon"},
          {"name": "Tomato Passata", "amount": "200 ml"},
          {"name": "Dark Chocolate", "amount": "20 grams"},
          {"name": "Butter", "amount": "30 grams"},
          {"name": "Chipotle sauce", "amount": "1 teaspoon"},
          {"name": "Cumin", "amount": "1 teaspoon"},
          {"name": "Paprika", "amount": "1 teaspoon"},
          {"name": "Tomato Puree", "amount": "2 tablespoons"}
      ],
      "prep_instructions": [
          "Chop up the chilli and garlic into small pieces. Cut the Onion and peppers into strips or pieces around an inch or so long",
          "Pour the kidneys beans into a strainer and rinse them off with cold water"
      ],
      "cooking_instructions": [
          "Put the pan on a medium heat and start frying off the beef mince in some oil. Add some salt and pepper while doing this for seasoning. Stir and prod the mince until it's broken up into small pieces.Before it's fully cooked take it off the heat and put it to the side",
          "Using the same pan, turn the heat up a little and add some more oil as well as the peppers and the onions",
          "At the same time, heat up some oil on a low heat and add the garlic and fresh chilli. Once it starts to sizzle add the chopped tomatoes and the tomato passata and tomato puree.",
          "Add both the meat and the cooked peppers and onions and the kidney beans to the tomato sauce. Stir all together and add the remaining ingredients: Cumin, paprika, chipotle sauce, butter, dark chocolate and chilli flakes (depending how spicy you want it)",
          "Keep stirring until you bring it to a simmer. Add water in order to lighten the sauce if needed. Let simmer for 20/30 mins with the lid on before turning off the heat",
          "Serve and enjoy!"
      ]
  },
  {
      "name": "Chickpea & Scrambled Egg Wraps",
      "description": "A healthy and nutritious recipe for a lunchtime wrap easy to eat at home or on the go!",
      "category": "lunch",
      "servings": 4,
      "cooking_time": "30 Minutes",
      "is_sample": true,
      "image": "/path/to/fake/image",
      "tags": ["Lunch", "Wraps & Sandwiches", "Vegetarian"],
      "ingredients": [
          {"name": "Chickpeas", "amount": "80 Grams"},
          {"name": "Sweet Potato", "amount": "40 Grams"},
          {"name": "Eggs", "amount": "3"},
          {"name": "Spinach", "amount": "30 Grams"},
          {"name": "Avocado", "amount": "1"},
          {"name": "Garlic", "amount": "1 clove"},
          {"name": "Wraps", "amount": "4"},
          {"name": "Cumin", "amount": "1/2 teaspoon"},
          {"name": "Paprika", "amount": "1/2 teaspoon"}

      ],
      "prep_instructions": [
          "Roll out the chickpeas onto some kitchen roll and pick off the loose skins. This is a big help when baking. Add them to a bowl with some oil, salt, pepper, cumin and paprika before tossing together. Add them to a baking tray",
          "Chop up the sweet potato into small cubes. Toss with some oil, salt, pepper, paprika and cumin before adding them to another baking tray",
          "Combine the avocado with the garlic alongside some salt and pepper",
          "Whisk together the eggs with a fork until fully combined"
      ],
      "cooking_instructions": [
          "Put both the baking trays containing the chickpeas and the sweet potato into the oven at 180C. Cook for approx. 20-25 minutes stirring them every 5 minutes or so.",
          "On medium heat add some oil to a pan before pouring in the egg mixture. Stir until eggs or cooked and remove them and put them to the side",
          "Lay out one of the wraps. Add your avocado, spinach, eggs, sweet potato and then chickpeas. Wrap tightly and it is ready to eat!"
      ]
  },
  {
      "name": "Breakfast Burritos",
      "description": "A quick recipe for a big and healthy breakfast to get the day started right!",
      "servings": 2,
      "category": ["breakfast", "lunch"],
      "cooking_time": "20 Minutes",
      "is_sample": true,
      "image": "/path/to/fake/image",
      "tags": ["Lunch", "Wraps & Sandwiches", "Breakfast"],
      "ingredients": [
          {"name": "Eggs", "amount": "5"},
          {"name": "Peppers", "amount": "1/2 pepper"},
          {"name": "Bacon", "amount": "2"},
          {"name": "Mozzarella", "amount": "30 Grams"},
          {"name": "Mayonaise", "amount": "40 ml"},
          {"name": "Hot Sauce", "amount": "1 tablespoon"},
          {"name": "Wraps", "amount": "2"}

      ],
      "prep_instructions": [
          "Combine the mayonaise and the hot sauce until fully mixed together",
          "Whisk together the eggs with a fork until fully combined"
      ],
      "cooking_instructions": [
          "Under the grill/broiler put the bacon on a high heat. Flip over when the first side is cooked",
          "On medium to high heat, add a little oil and the peppers along with some salt and pepper. When the bacon is cooked, chop it up and add it to the pan also.",
          "Turn down the heat to medium and add the egg mix. Stir the mixture until cooked.",
          "On the wrap, pour the mayonaise/hot sauce mix and layer it over the wrap. Add the egg mixture and then sprinkle the cheese onto the top.",
          "On medium heat add a little bit of oil to the pan. Fold over the wrap and put it on the pan. Put folded side down to ensure the cheese is melted. Depending on if you want both sides toasted, flip over or just fry on one side",
          "Serve and Enjoy!"
      ]
  },

  {
      "name": "Chickpea Burgers",
      "description": "A simple recipe for delicious and healthy veggie burgers!",
      "servings": 3,
      "category": "dinner",
      "cooking_time": "60 Minutes",
      "is_sample": true,
      "image": "/path/to/fake/image",
      "tags": ["Dinner", "Vegetarian"],
      "ingredients": [
          {"name": "Chickpeas", "amount": "1 Tin"},
          {"name": "Egg", "amount": "1"},
          {"name": "Red Onion", "amount": "1"},
          {"name": "Garlic", "amount": "2 cloves"},
          {"name": "Cumin", "amount": "1.5 teaspoons"},
          {"name": "Paprika", "amount": "1 teaspoon"},
          {"name": "Burger Buns", "amount": "3"},
          {"name": "Mayonaise", "amount": "40 ml"},
          {"name": "Hot Sauce", "amount": "1 tablespoon"},
          {"name": "Lettuce", "amount": "30 grams"},
          {"name": "Olive Oil", "amount": "30 ml"},
          {"name": "Cheese", "amount": "40 grams"}

],
"prep_instructions": [
  "Dice up the garlic and half the red onion into small/medium pieces. Cut the other half of the red onion into rings.",
  "Combie the chickpeas, the diced up garlic and red onion, cumin, paprika, egg and half olive oil. Add to a food processor and run until all the ingredients are completely combined. Add salt and pepper during this process to taste",
  "Combine the mayonaise and the hot sauce until fully mixed together"
],
"cooking_instructions": [
  "Split the chickpea mix into 3 equal parts. Carefully shape them into burgers around half an inch thick. Wider but thinner is generally a better idea.",
  "Oil a baking tray and place the 3 burgers on top. Put in an oven at around 180C. After about 15 minutes when you can see the top of the burger has browned, carefully flip over. Let cook for another 15 minutes",
  "Start frying the remaing onions. Add a little brown sugar if you would like to carmelise them",
  "Toast the open side of the burgers. On the top half add cheese and put under the grill in order to melt the cheese",
  "Add some of the fried onions, lettuce and the burger onto your burger bun, being careful not to let the burger break apart.",
  "Serve and Enjoy!"
]
},

{
  "name": "Beef Burgers with Garlic & Parmesan Chips",
  "description": "An easy recipe for homemade burgers and chips that are great for any dinner party!",
  "servings": 4,
  "category": "dinner",
  "cooking_time": "70 Minutes",
  "is_sample": true,
  "image": "/path/to/fake/image",
  "tags": ["Dinner", "For Sharing"],
  "ingredients": [
      {"name": "Beef Mince", "amount": "400 Grams"},
      {"name": "Egg", "amount": "1"},
      {"name": "Red Onion", "amount": "1/2"},
      {"name": "Garlic", "amount": "2 cloves"},
      {"name": "Potatoes", "amount": "3 or 4 potatoes"},
      {"name": "Parmesan", "amount": "20 grams"},
      {"name": "Burger Buns", "amount": "4"},
      {"name": "Mayonaise", "amount": "40 ml"},
      {"name": "Butter", "amount": "20 grams"},
      {"name": "Hot Sauce", "amount": "1 tablespoon"},
      {"name": "Lettuce", "amount": "30 grams"},
      {"name": "Cheese", "amount": "40 grams"},
      {"name": "Dried parsley", "amount": "1 tablespoon"}
],
"prep_instructions": [
  "Split the mince into 8 equal parts. Squish them as thin as possible and leave them to the side",
  "Cut the potatoes into chips, leaving the skin on",
  "Cut the red onion into rings and chop the garlic into very small pieces",
  "Combine the mayonaise and the hot sauce until fully mixed together"
],
"cooking_instructions": [
  "Put the potatoes into cold water and bring to the boil. At the same time, start preheating the oven with the baking tray inside at 170C. Once they come to a boil, let them boil for 2/3 minutes before taking them out. Add them to the baking tray with salt, pepper and some oil. Shake them regularly.",
  "After roughly 30 mins melt the butter and combine it with the garlic and parsley. Add these to the potatoes and coat them completely before adding back to the oven",
  "Turn a pan onto high heat and add some oil before adding the burgers. Add salt and pepper once the burgers get added to the pan. Flip once you get a good browning on the first side and repeat on the other side. Add the red onion to the pan also, stirring occasionaly.",
  "Once the burgers are cooked turn down the heat and place some of the cheese on top of each burger. Put one of the small patties on top of another one and wait for the cheese to melt. Take them off the pan once melted",
  "Toast the buns and then add the mayonaise mix, lettuce, red onion and then the burgers",
  "Take the potatoes out of the oven and grate parmesan on top of the chips.",
  "Plate up and enjoy!"
]
},

{
  "name": "Overnight Oats",
  "description": "A quick way to have breakfast ready for when you get up every morning.",
  "servings": 1,
  "category": "breakfast",
  "cooking_time": "5",
  "is_sample": true,
  "image": "/path/to/fake/image",
  "tags": ["Breakfast", "Vegetarian"],
  "ingredients": [
      {"name": "Oats", "amount": "2 Scoops"},
      {"name": "Protein Powder", "amount": "1/2 scoops"},
      {"name": "Milk", "amount": "100 ml"},
      {"name": "Yoghurt", "amount": "1 tablespoon"},
      {"name": "Mixed berries", "amount": "20 grams"},
      {"name": "Peanut butter", "amount": "1 tablespoon"}
  ],
  "prep_instructions": [
      "Mix together the oats, protein powder and mixed berries",
      "Add the milk and youghurt and mix again.",
      "Cover the oats and leave in the fridge overnight",
      "The next morning, add the peanut butter before stirring the oats again."
  ]
}
]
}